---
kind: type
id: T:Autodesk.Revit.DB.DirectShapeTypeUserAssignability
source: html/2d6edb93-3c18-dc5b-e13b-95b135509de4.htm
---
# Autodesk.Revit.DB.DirectShapeTypeUserAssignability

Options for a DirectShapeType which affect whether or not it can be assigned as the type of a DirectShape.

## Syntax (C#)
```csharp
public enum DirectShapeTypeUserAssignability
```

## Remarks
Only DirectShapeTypes which permit assignability will be shown in the type selector dialog.
 A DirectShape which uses a DirectShapeType which is not assignable can be copied.